package 类和对象前言1;
/*
    什么是对象：万物皆对象，客观存在的事物皆为对象
    什么是对象的属性：对象具有的各种特征，每个对象的每个属性都拥有特定的值
    什么是对象的行为：对象能够执行的操作

    什么是类：类是对现实生活中一类具有共同属性和行为的事物的抽象，确定对象将会拥有的属性和行为
    类的重要性：是JAVA程序的基本组成单位
    类的组成：属性和行为
            1.属性：在类中通过成员变量来体现（类中方法外的变量）
            2.行为：在类中通过成员方法来体现（和前面的方法相比去掉static关键字即可）
    类的特点：1.类是对象的数据类型
            2.类是具有相同属性和行为的一组对象的集合
    类的定义步骤：①定义类  ②编写类的成员变量  ③编写类的成员方法
               public class 类名 {
                    //成员变量
                    变量1的数据类型 变量1；
                    变量2的数据类型 变量2；
                    ......
                    //成员方法
                    方法1；
                    方法2；
                    ......
               }

    类和对象的关系：1.类：类是对现实生活中一类具有共同属性和行为的事物的抽象
                2.对象：是能够看得到摸得着的真实存在的实体
 */

